def bubble_sort(arr):
    n = len(arr)
    
    for i in range(n):
        print(arr)
        
        # 해당하는 회전에 이미 끝부분에 정렬되어있는 원소와의 불필요한
        # 비교는 피하기 위해 range의 범위를 아래와 같이 설정해준다.
        for j in range(0, n - i - 1):
    
            if arr[j] > arr[j + 1]: 
                arr[j], arr[j + 1] = arr[j + 1], arr[j] 
    return arr

arr1=[10,5,4,7,8,2,3,9]
bubble_sort(arr1)

# 결과값
# [10, 5, 4, 7, 8, 2, 3, 9]
# [5, 4, 7, 8, 2, 3, 9, 10]
# [4, 5, 7, 2, 3, 8, 9, 10]
# [4, 5, 2, 3, 7, 8, 9, 10]
# [4, 2, 3, 5, 7, 8, 9, 10]
# [2, 3, 4, 5, 7, 8, 9, 10]
# [2, 3, 4, 5, 7, 8, 9, 10]
# [2, 3, 4, 5, 7, 8, 9, 10]
